## Data Wrangling & Pre-Processing

### Imports

In [2]:
import pandas as pd

In [3]:
#loading in our data set
df = pd.read_csv("https://s3.amazonaws.com/dstkh.datasets/PS_20174392719_1491204439457_log.csv")

### Cleaning our data

In [4]:
#identify null values
df.isna().sum()

step              0
type              0
amount            0
nameOrig          0
oldbalanceOrg     0
newbalanceOrig    0
nameDest          0
oldbalanceDest    0
newbalanceDest    0
isFraud           0
isFlaggedFraud    0
dtype: int64

In [5]:
#drop unnecessary columns
df = df.drop([
    'step', 'nameOrig', 'nameDest', 'isFlaggedFraud', 'oldbalanceOrg', 'newbalanceDest'
], axis=1)

In [6]:
df.head()

       type    amount  newbalanceOrig  oldbalanceDest  isFraud
0   PAYMENT   9839.64       160296.36             0.0        0
1   PAYMENT   1864.28        19384.72             0.0        0
2  TRANSFER    181.00            0.00             0.0        1
3  CASH_OUT    181.00            0.00         21182.0        1
4   PAYMENT  11668.14        29885.86             0.0        0

In [10]:
dummies = pd.get_dummies(df['type'], dtype=int)

In [12]:
df = pd.concat([dummies, df], axis=1).drop(['type'], axis=1)
df.head()

,CASH_IN,CASH_OUT,DEBIT,PAYMENT,TRANSFER,amount,newbalanceOrig,oldbalanceDest,isFraud
0,0,0,0,1,0,9839.64,160296.36,0.0,0
1,0,0,0,1,0,1864.28,19384.72,0.0,0
2,0,0,0,0,1,181.00,0.00,0.0,1
3,0,1,0,0,0,181.00,0.00,21182.0,1
4,0,0,0,1,0,11668.14,29885.86,0.0,0

In [ ]:
#drop columns
    step
    isFlaggedFraud
    nameOrig
    nameDest